app/Controllers/Myhome.php

    public function createContact()
    {
        $userModel = new \App\Models\Contact();

        $msg="";

        $data = [
            'name' => $this->request->getVar('name'),
            'email'    => $this->request->getVar('email'),
            'phone'    => $this->request->getVar('phone'),
            'message'    => $this->request->getVar('msg'),
        ];

        try{
            $userModel->insert($data, false);
---
INSERT INTO `contact` (`name`, `email`, `phone`, `message`) VALUES (NULL, NULL, NULL, NULL)